budget_api/app/models/line_item.rb

  def add_order
    self.order = self.budget.line_items.count + 1
---
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."budget_id" = $1  [["budget_id", 5]]