budget_api/app/controllers/budgets_controller.rb

  def index
    @budgets = Budget.all
---
SELECT "budgets".* FROM "budgets"

  def create
    @budget = Budget.new(budget_params)

    if @budget.save
---
INSERT INTO "budgets" ("name", "total_amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Lunch"], ["total_amount", 28], ["created_at", "2020-03-23 19:16:01.070452"], ["updated_at", "2020-03-23 19:16:01.070452"]]

  def destroy
    @budget.destroy
---
DELETE FROM "budgets" WHERE "budgets"."id" = $1  [["id", 22]]

    def set_budget
      @budget = Budget.find(params[:id])
---
SELECT "budgets".* FROM "budgets" WHERE "budgets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]