budget_api/app/controllers/line_items_controller.rb

INSERT INTO "line_items" ("budget_id", "amount", "status", "created_at", "updated_at", "name", "order") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["budget_id", 6], ["amount", 100.0], ["status", "Tentative"], ["created_at", "2020-03-26 18:57:03.869774"], ["updated_at", "2020-03-26 18:57:03.869774"], ["name", "test"], ["order", 1]]
---
  def create
    @line_item = LineItem.new(line_item_params)
    if @line_item.save

UPDATE "line_items" SET "amount" = $1, "name" = $2, "updated_at" = $3 WHERE "line_items"."id" = $4  [["amount", 3123.0], ["name", "SDF"], ["updated_at", "2020-03-27 15:33:17.576799"], ["id", 12]]
---
  def update
    if @line_item.update(line_item_params)